---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.Append(Autodesk.Revit.DB.EdgeArray)
source: html/40e9b55d-92f6-d0c1-bf84-28460620860f.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.Append Method

Add the edge array to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	EdgeArray item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.EdgeArray`) - The edge array to be added.